import React from 'react';
import { useNavigate } from 'react-router-dom';
import '../../styles/HomePage.css';


const HomePage = () => {
    const navigate = useNavigate();
  return (
    <div className="home-page">
      <section className="home-content">
        <p>
        ΠΟΘΕΝ ΕΣΧΕΣ

            ΕΙΣΑΓΩΓΗ
            ΓΕΝΙΚΕΣ ΠΛΗΡΟΦΟΡΙΕΣ ΕΦΑΡΜΟΓΗΣ
            Η παρούσα ηλεκτρονική πλατφόρμα υλοποιήθηκε ανταποκρινόμενη στις απαιτήσεις
            που προέκυψαν με το νέο νόμο για το Πόθεν Έσχες (ν. 5026/2023) και την ενιαία
            διαδικτυακή εφαρμογή «ΠΟΘΕΝ».
            Η εν λόγω πλατφόρμα θα συμβάλει στο έργο της ομάδας εργασίας της Γενικής
            Γραμματείας Πολιτικής Προστασίας για το Πόθεν Έσχες, η οποία συγκροτήθηκε με
            την υπ’ αριθμ. 1065/14.02.2022 απόφαση του Γενικού Γραμματέα Πολιτικής
            Προστασίας και εν συνεχεία τροποποιήθηκε με την υπ’ αρ. 8079/17.05.2023.
            Έργο της ομάδας εργασίας είναι ο καθορισμός των υπόχρεων σε Δήλωση
            Περιουσιακής Κατάστασης και Δήλωση Οικονομικών Συμφερόντων του ν. 3213/2003,
            όπως ισχύει («Πόθεν Έσχες») για το πολιτικό προσωπικό της Γενικής Γραμματείας
            Πολιτικής Προστασίας και τους μετακλητούς υπαλλήλους των ιδιαίτερων γραφείων
            του Υπουργού και Υφυπουργού Κλιματικής Κρίσης και Πολιτικής Προστασίας,
            Γενικού Γραμματέα και Αναπλ. Γενικού Γραμματέα, καθώς και τη σύνταξη και την
            ηλεκτρονική καταχώρηση του πίνακα υπόχρεων (μηνιαίος και ετήσιος) στην ενιαία
            διαδικτυακή εφαρμογή «ΠΟΘΕΝ».
            Η συλλογή των στοιχείων της πλατφόρμας θα γίνεται αποκλειστικά από την ομάδα
            εργασίας, με μοναδικό σκοπό την έγκυρη ανταπόκριση στο προαναφερθέν έργο της
            ομάδας.
            Σύμφωνα με τον Γενικό Κανονισμό Προστασίας Προσωπικών Δεδομένων, τα
            δεδομένα που θα συλλέγονται θα τηρούνται για χρονικό διάστημα πέντε ετών. Μετά
            την παρέλευση του προαναφερθέντος διαστήματος, τα δεδομένα θα καταστρέφονται
            από την αρμόδια οργανική μονάδα.
            ΛΕΙΤΟΥΡΓΙΚΕΣ ΠΛΗΡΟΦΟΡΙΕΣ ΠΛΑΤΦΟΡΜΑΣ
            Σκοπός της εν λόγω πλατφόρμας είναι η καταχώρηση στοιχείων που δηλώνουν την
            απόκτηση/διατήρηση/απώλεια της ιδιότητας υπόχρεου σε δήλωση περιουσιακής
            κατάστασης και εξυπηρετούν στην κατάρτιση τόσο των μηνιαίων όσο και των ετήσιων
            καταστάσεων του φορέα στην διαδικτυακή εφαρμογή «ΠΟΘΕΝ», έτσι ώστε τα
            εξαγόμενα αποτελέσματα να αναρτώνται από την αρμόδια ομάδα εργασίας στην
            διαδικτυακή εφαρμογή «Πόθεν».
            Προς υποβοήθηση της συμπλήρωσης της βάσης δεδομένων, απαιτείται η
            απρόσκοπτη συνεργασία της Διεύθυνσης Προμηθειών της Γενικής Διεύθυνσης
            Οικονομικών Υπηρεσιών, της Αυτοτελούς Διεύθυνσης Διοίκησης και Υποστήριξης,
            της Διεύθυνσης Τεχνικών Έργων και Περιβάλλοντος καθώς και των υπόχρεων
            υπαλλήλων του φορέα.
        </p>
        <button className="home-button" onClick={() => navigate('/submit')}>
          Go to Sumbission
        </button>
      </section>
    </div>
  );
};

export default HomePage;