import React from 'react';

const NoteInput = () => {
  return (
    <div className="note">
      <p>
        Οι υπόχρεοι των οποίων η οικογενειακή κατάσταση έχει μεταβληθεί, εντός του αναφερόμενου έτους, σε σχέση με την τελευταία οριστικοποιημένη αρχική ή ετήσια Δ.Π.Κ. του προηγούμενου έτους αναφοράς, καθώς και όσοι απέκτησαν ιδιότητα υπόχρεου για πρώτη φορά στο αναφερόμενο έτος, απαιτείται να συνδεθούν στην εφαρμογή «Γνωστοποίηση Στοιχείων Συζύγου/ΜΣΣ Υπόχρεου Πόθεν Έσχες» στην διεύθυνση https://www.pothen.gr/syzygos, προκειμένου να γνωστοποιήσουν τον Αριθμό Φορολογικού Μητρώου (Α.Φ.Μ.) των συζύγων τους, των εν διαστάσει συζύγων τους ή των προσώπων με τα οποία έχουν συνάψει σύμφωνο συμβίωσης
      </p>
    </div>
  );
};

export default NoteInput;